Концепт:
Веб приложение, которое сможет вести учет эксплуатируемого ПО и их версии.
Т.е. каким-то образом будет следить за всем используемым ПО  
и периодически проверять на наличие обновлений источники
Исторические данные можно сохранять и соответственно на каждое ПО  
можно прямв интерфейсе посмотреть последнюю вресию + промежуточные от текущей.

Фичи:
 - следить за адпейтами докер образов
 - следить за адпейтами в pypi
 - следить за апдейтами в go.mod?
 - хранить исторические данные о текущей - следующей - последней версиях
 - система нотификации в телегу\почту\слак\тимс\смс
 - в будущем возможно делать таски на автоматический апдейт до указанной версии(тут можно интегрироваться с гитом)?
 - после апдейта соответственно откатываться к любой предыдущей (тут можно интегрироваться с гитом)?
 - возможно напрямую парсить версии ПО через их АПИ?
